{
  "room_names" :
  {
    "1": "Начальная страница",
    "2": "Создатели",
    "3": "Помощь",
    "4": "Звонок Джона",
    "5": "Дом героя",
    "6": "Улица",
    "7": "Пригород",
    "8": "Центр города",
    "9": "Гараж Джона",
    "10": "Джон",
    "11": "Большой процент",
    "12": "Малый процент",
    "13": "Рассказ об Эммете",
    "14": "Свалка Эммета",
    "15": "Эммет",
    "16": "Плохое оружие",
    "17": "Хорошее оружие",
    "18": "Рассказ об Смите",
    "19": "Банк",
    "20": "Бар \"Золотая гадюка\"",
    "21": "Игрок выпивает",
    "22": "Игрок выпивает ещё",
    "23": "Игрок в отрезвителе",
    "24": "Смит",
    "25": "Плохая взрывчатка",
    "26": "Хорошая взрывчатка",
    "27": "Подход к банку",
    "28": "Вход в хранилище",
    "29": "Арест из-за взрывчатки",
    "30": "Взрыв двери",
    "31": "Отгадывание загадки",
    "32": "Неправильный ответ",
    "33": "Грабёж хранилища",
    "34": "Ранение Джона",
    "35": "Делёж добычи",
    "36": "Смерть от рук Джона",
    "37": "Попытка убить банду",
    "38": "Квест выполнен",
    "39": "Отказ грабить",
  },
  "room_text" :
  {
    "1": "Добро пожаловать в текстовый квест \"Ограбление\" дня. Введите имя в боковом окошке и нажмите начать, чтобы запустить квест.",
    "2": "Создатели \n Команда Dryandex.",
    "3": "Выбирайте ответы из предложенных, чтобы пройти квест.",
    "4": "Обычное утро человека, залегающего на дне. Неожиданно вам позвонил Джон - ваш старый компаньон по опустошению мелких ларьков. Он предложил вам грабить банк. Вы согласны?",
    "5": "Вы стоите посреди своей комнаты. У вас неприбрано. Но это неважно, ведь вы скоро ограбите банк и заживёте на Канарах, где вам будет далеко не до мусора. Но если вы тут простоите весь день, мусор не исчезнет.",
    "6": "На улице стоит мерзкая и грязная осенняя погода. Утро явно не задаётся. Куда направитесь - в пригород, в центр или вернётесь домой?",
    "7": "Пригород кажется грязнее вашей улицы. И даже грязнее вашей спальни. Но вы сюда не пошли бы просто так, верно?",
    "8": "Центр кажется вам скучным и немного грязноватым. Вдали виднеется здание банка. Вам привиделась река денег, текущих в направлении от банка. \"По сути, мираж вещий\" - улыбнулись вы.",
    "9": "Гараж интерьером не выделяется. На стенах подвешено множество машинных внутренностей. От музея доисторической техники его отличает лишь то, что в экспонате, стоящем в углу, копается ваш знакомый Джон.",
    "10": "Здравствуй, {name}. Я тут в машине копаюсь. В той самой, на которой мы поедем грабить банк. Что говоришь? Развалится по дороге? Как водитель отвечаю за исправность вопроса траспорта. Я же в деле, да?",
    "11": "А ты, оказывается, широкая душа! Я не забуду. Что? Конечно согласен. Но нам нужен будет мой знакомый Эммет.",
    "12": "Ну ты и жлобяра! Когда ты так испортился? Припомню я это тебе, так и знай. Смотри Эммету не предложи больше, а то разоришься.",
    "13": "Эммет - это мой старый проверенный оружейник. Его арсенал похож на музей. Что? Как мой гараж? Немного хуже. Он отирается на городской свалке, ковыряет сдохшую бытовую технику, и тебе нужно будет к нему сходить.",
    "14": "Вы стоите на городской свалке. Отсутствуют всякие ориентиры. Чтобы выйти с неё или найти Эммета понадобится время. Много времени.",
    "15": "Кто такой? {name}? От Джона? Этого драндулетного тюннингиста? Ну и что хотел сказать? \n\"Да... Настоящий Властелин свалки\" - подумали вы. ",
    "16": "Да за такие гроши чирей на заднице не вскочит! А ты пушки захотел! Ну ничего. Хи-хи... Бери вон тот ящик со стволами и кусочек наждачной бумаги - ржавчину стирать. Предложил бы больше, был бы другой разговор. Был бы тут Смит, взорвал тебя нахрен.",
    "17": "Не густо. Но так и быть. Вон там лежит коробка с новыми, всего пять лет, автоматами. Как вернётесь в город, найдите меня на этой свалке, или в городской тюрьме, хи-хи... Дружку моему, Смиту, привет передавайте.",
    "18": "Кто такой Смит? Это мой знакомый подрывных дел мастер. Если что вскрыть надо или появиться эффектно, то это к нему. Он обычно в баре \"Золотая гадюка\" опохмеляется. Сходите к нему обязательно.",
    "19": "Вы стоите в банке. Весь интерьер подталкивает его посетителей скорее отдать свои денежки. А вас - вынести эти сбережения при близжайшем рейде. А так - здесь скучно.",
    "39": "Какой вы скучный! Вы читали название квеста? Там написано: \"Ограбление\", а вы? Ну и катитесь с Богом, уважаемый мещанин."
  }
}