{
  "room_names" :
  {
    "1": "Начальная страница",
    "2": "Создатели",
    "3": "Помощь",
    "4": "Звонок Джона",
    "5": "Дом героя",
    "6": "Улица",
    "7": "Пригород",
    "8": "Центр города",
    "9": "Гараж Джона",
    "10": "Джон",
    "11": "Большой процент",
    "12": "Малый процент",
    "13": "Рассказ об Эммете",
    "14": "Свалка Эммета",
    "15": "Эммет",
    "16": "Плохое оружие",
    "17": "Хорошее оружие",
    "18": "Рассказ об Смите",
    "19": "Банк",
    "20": "Бар \"Золотая гадюка\"",
    "21": "Игрок выпивает",
    "22": "Игрок выпивает ещё",
    "23": "Игрок в отрезвителе",
    "24": "Смит",
    "25": "Плохая взрывчатка",
    "26": "Хорошая взрывчатка",
    "27": "Подход к банку",
    "28": "Вход в хранилище",
    "29": "Арест из-за взрывчатки",
    "30": "Взрыв двери",
    "31": "Отгадывание загадки",
    "32": "Неправильный ответ",
    "33": "Грабёж хранилища",
    "34": "Ранение Джона",
    "35": "Делёж добычи",
    "36": "Смерть от рук Джона",
    "37": "Попытка убить банду",
    "38": "Квест выполнен",
    "39": "Отказ грабить"
  },
  "room_text" :
  {
    "1": "Добро пожаловать в текстовый квест \"Ограбление\" дня. Введите имя в боковом окошке и нажмите начать, чтобы запустить квест.",
    "2": "Создатели \n Команда Dryandex.",
    "3": "Выбирайте ответы из предложенных, чтобы пройти квест.",
    "4": "Обычное утро человека, залегающего на дне. Неожиданно вам позвонил Джон - ваш старый компаньон по опустошению мелких ларьков. Он предложил вам грабить банк. Вы согласны?",
    "5": "Вы стоите посреди своей комнаты. У вас неприбрано. Но это неважно, ведь вы скоро ограбите банк и заживёте на Канарах, где вам будет далеко не до мусора. Но если вы тут простоите весь день, мусор не исчезнет.",
    "6": "На улице стоит мерзкая и грязная осенняя погода. Утро явно не задаётся. Куда направитесь - в пригород, в центр или вернётесь домой?",
    "7": "Пригород кажется грязнее вашей улицы. И даже грязнее вашей спальни. Но вы сюда не пошли бы просто так, верно?",
    "8": "Центр кажется вам скучным и немного грязноватым. Вдали виднеется здание банка. Вам привиделась река денег, текущих в направлении от банка. \"По сути, мираж вещий\" - улыбнулись вы.",
    "9": "Гараж интерьером не выделяется. На стенах подвешено множество машинных внутренностей. От музея доисторической техники его отличает лишь то, что в экспонате, стоящем в углу, копается ваш знакомый Джон.",
    "10": "Здравствуй, {name}. Я тут в машине копаюсь. В той самой, на которой мы поедем грабить банк. Что говоришь? Развалится по дороге? Как водитель отвечаю за исправность вопроса траспорта. Я же в деле, да?",
    "11": "А ты, оказывается, широкая душа! Я не забуду. Что? Конечно согласен. Но нам нужен будет мой знакомый Эммет.",
    "12": "Ну ты и жлобяра! Когда ты так испортился? Припомню я это тебе, так и знай. Смотри Эммету не предложи больше, а то разоришься.",
    "13": "Эммет - это мой старый проверенный оружейник. Его арсенал похож на музей. Что? Как мой гараж? Немного хуже. Он отирается на городской свалке, ковыряет сдохшую бытовую технику, и тебе нужно будет к нему сходить.",
    "14": "Вы стоите на городской свалке. Отсутствуют всякие ориентиры. Чтобы выйти с неё или найти Эммета понадобится время. Много времени.",
    "15": "Кто такой? {name}? От Джона? Этого драндулетного тюннингиста? Ну и что хотел сказать? \n\"Да... Настоящий Властелин свалки\" - подумали вы. ",
    "16": "Да за такие гроши чирей на заднице не вскочит! А ты пушки захотел! Ну ничего. Хи-хи... Бери вон тот ящик со стволами и кусочек наждачной бумаги - ржавчину стирать. Предложил бы больше, был бы другой разговор. Был бы тут Смит, взорвал тебя нахрен.",
    "17": "Не густо. Но так и быть. Вон там лежит коробка с новыми, всего пять лет, автоматами. Как вернётесь в город, найдите меня на этой свалке, или в городской тюрьме, хи-хи... Дружку моему, Смиту, привет передавайте.",
    "18": "Кто такой Смит? Это мой знакомый подрывных дел мастер. Если что вскрыть надо или появиться эффектно, то это к нему. Он обычно в баре \"Золотая гадюка\" опохмеляется. Сходите к нему обязательно.",
    "19": "Вы стоите в банке. Весь интерьер подталкивает его посетителей скорее отдать свои денежки. А вас - вынести эти сбережения при близжайшем рейде. А так - здесь скучно.",
    "20": "Вы находитесь в баре\"Золотая гадюка\". Благовонный дымок летает по залу. Бармен за стойкой жонглирует рюмками. Вдали сидит человек, внешность которого можно описать одним словом - Смит.",
    "21": "Вы просите накатить бармена по маленькой, для понимания с посетителями. Местное пойло больше похоже на ракетное топливо, чем на пищевой спирт. Но вас, однако пробрало.",
    "22": "Вам, видимо, показалось мало и вы решили догнаться. Как это можно пить? Однако оно льётся, поэтому вы и выпили. Вас начало шатать, и вам подозрительно для окружающих весело.",
    "23": "Третьего захода ваше сознание не выдержало. Вы сначала начали слоняться с криками по залу, опрокидывая столики, а затем свалились, как простреленный. Сидя в отрезвителе, вы поняли, что об ограблении стоит забыть.",
    "24": "Перед вами сидит Смит. Вы ему уже рассказали, что вы от Эммета, и хотите грабить банк. Вы можете договориться насчёт взрычатки, если у вас её ещё нет.",
    "25": "\"Маловато. Взрывчатка будет не высший сорт. Сами вы ничего не взорвёте, я поеду в рейд с вами.\" Похоже, вы собрали банду. Ступайте домой и готовьтесь к ограблению.",
    "26": "\"С тобой приятно иметь дело, разбойник. Порох будет просто бомба. Я поеду в рейд с вами.\" Похоже, вы собрали банду. Ступайте домой и готовьтесь у ограблению.",
    "27": "Настало то самое утро, после которого жизнь ваша должна преобразиться. Вы, Джон и Смит уселись в драндулет Джона и отправились в банк. Войти вы решили через дыру собственного взрыва - Смит постарался.",
    "28": "Вы стоите перед бронированным люком, преграждающим вам дорогу к денежкам. Вы можете попросить Смита убрать преграду, а можете отгадать код. Подсказка к коду оказалась загадкой. Нужно торопиться - полиция на подходе.",
    "29": "\"Зараза! Не взрывается!\" - Смит невольно начал материться на детонатор. Пока он возился с бомбой, вас окружила полиция.\n А ведь он вас предупреждал насчёт плохой взрычатки...",
    "30": "Смит разделался и с этой преградой. От богатства вас отделяет отверстие в стене, котрое недавно было дверью, и всего пара шагов!",
    "31": "Одна труба наполняет бассейн за 6 часов. Вторая труба наполняет его за 9 часов. Пропускная способность второй трубы меньше на две единицы объёма в час чем у первой трубы. Определите, за сколько часов эти две трубы наполнят этот бассейн вместе.",
    "32": "Если вы не отвечали наугад, то на теме \"квадратные уравнения\" вы хорошо спали. Направильный ответ включил запоздалую сигнализацию, которая заперла вас до приезда полиции.",
    "33": "Вы зашли в хранилище. Ошалелые руки всех членов вашей банды и вас в том числе принялись загребать в мешки результаты чужого капитализма. Полиция на подходе, надо уходить!",
    "34": "\"Чёртого ружьё! Заело!\" - закричал Джон, отстреливаясь от полиции. Но почти сразу его ранили в ногу и он упал. Вы подбежали к нему, пытаясь поднять своего кореша. Полиция успела вас окружить.\n Вы пожалели деньги на оружие, и оно вас подвело.",
    "35": "Вы оторвались от погони и едете в машине за городом. Пора делить добычу. \"А зачем платить этим бандитам?\" - мелькнула у вас мысль, глядя на компаньонов.",
    "36": "\"Жадность фраера сгубила...\" - заявил Джон, и провёл вам лезвием по горлу.\n\"Это научит тебя делиться. Хи-хи...\"",
    "37": "Вы связались не с теми ребятами. Опытные головорезы, почуяв неладное, устроили резню.\nВы полегли первым.",
    "38": "Разделив добычу, вы расстались с компаньонами. Теперь вы живёте на Канарах, где вам далеко на до мусора.\nМечты сбываются, прямо как в газпроме.",
    "39": "Какой вы скучный! Вы читали название квеста? Там написано: \"Ограбление\", а вы? Ну и катитесь с Богом, уважаемый мещанин."
  },
  "ways":
  {
    "1 4": "Начать игру",
    "1 2": "Создатели",
    "1 3": "Помощь",
    "1 0": "Выход",
    "2 1": "Главное меню",
    "3 1": "Главное меню",
    "4 39": "Нет, я пас.",
    "4 5": "Конечно, надо начинать подготовку. Но сначала, навестить Джона в его гараже.",
    "5 6": "Выйти на улицу",
    "5 27": "Лечь спать. Завтра грабим банк!",
    "6 5": "Вернуться домой",
    "6 7": "Пойти в пригород",
    "6 8": "Напрвиться в центр",
    "7 6": "Вернуться на свою улицу",
    "7 8": "Пойти в центр",
    "7 9": "Наведаться в гараж Джона",
    "7 14": "Забрести на свалку к Эммету",
    "9 10": "Заговорить с Джоном",
    "9 7": "Выйти на улицу",
    "10 9": "Оставить Джона наедине с драндулетом.",
    "10 12": "Пригласить Джона в банду, предложив 7 процентов",
    "10 11": "Пригласить Джона в банду, предложив 20 процентов",
    "10 13": "Попросить Джона рассказать об Эммете",
    "11 10": "Отлично",
    "12 10": "Но-но, полегче",
    "13 10": "Схожу",
    "14 15": "Побродить в поисках Эммета",
    "14 7": "Побродить в поисках выхода со свалки",
    "15 14": "Оставить Эммета в покое",
    "15 16": "Попросить у Эммета оружие, предложив 7 процентов",
    "15 17": "Попросить у Эммета оружие, предложив 20 процентов",
    "15 18": "Попросить Эммета рассказать о Смите",
    "16 15": "И так сойдёт",
    "17 15": "С тобой приятно иметь дело, Эммет",
    "18 15": "Я загляну к нему",
    "8 6": "Вернуться к дому",
    "8 7": "Отправиться в пригород",
    "8 19": "Зайти в банк",
    "8 20": "Пойти в бар \"Золотая гадюка\"",
    "20 8": "Выйти на улицу",
    "20 21": "Выпить местного алкоголя",
    "20 22": "Между первой и второй...",
    "20 23": "Гуляем! Наливай ещё!",
    "20 24": "Подойти к Смиту",
    "21 20": "А... Х-х-хорошо...",
    "22 20": "Ух-х-х... Вот это да!",
    "23 1": "Квест провален",
    "24 20": "Отойти от Смита",
    "24 25": "Взять Смита в дело, предложив 7 процентов",
    "24 26": "Взять Смита в дело, предложив 20 процентов",
    "25 24": "Отлично, всё готово",
    "26 24": "Отлично, пора залечь на дно",
    "27 28": "Войти в банк через собственный вход",
    "28 29": "Давай, Смит. Эта дверь нам мешает!",
    "28 30": "Давай, Смит. Убери эту дверь!",
    "28 31": "Приступить к решению загадки",
    "29 1": "Квест провален ",
    "30 33": "Войти в хранилище",
    "31 1": "3.2",
    "31 33": "3.6",
    "33 34": "Удирать из банка",
    "33 35": "Живыми не дадимся, мусара!",
    "34 1": "Квест провален  ",
    "35 36": "Раздать участникам их долю",
    "35 37": "С мёртвыми не делятся. Бу-га-га",
    "35 38": "Разделить награбленное",
    "36 1": "Квест провален   ",
    "37 1": "Квест провален    ",
    "38 1": "Квест выполнен",
    "39 1": "Квест провален     "
  },
  "states":
  {
    "current_task": "Текущее задание:",
    "go_to_john": "Пойти в гараж Джона",
    "go_to_emmet": "Пойти на свалку к Эммету",
    "go_to_smith": "Пойти в бар к Смиту",
    "go_to_home": "Вернуться домой",
    "john_in_band": "Джон в банде",
    "emmet_in_band": "Эммет в банде",
    "smith_in_band": "Смит в банде",
    "small_percent": "Его доля 7 процентов",
    "big_percent": "Его доля 20 процентов"
  },
  "flags":
  {
    "john_percent": 0,
    "emmet_percent": 0,
    "smith_percent": 0,
    "alcohol": 0
  },
  "save":
  {
    "player": "Carl",
    "current_room": 0,
    "john_percent": 0,
    "emmet_percent": 0,
    "smith_percent": 0
  }
}